package shapes.shapesMain;

public class ShapesMain {

}


/*
Часть 2. В main в коде объявить массив фигур, чтобы в нём было около 5-10 разных фигур. Задача – написать функцию,
которая находит фигуру с максимальной площадью. Вызвать её для этого массива и распечатать информацию о фигуре в консоль.
Аналогично найдите фигуру со вторым по величине периметром.
Поиск фигур реализовать через стандартный метод Arrays.sort (в C# Array.Sort) с компаратором.
Что такое компаратор почитайте сами, но если будут вопросы, задавайте.
 */